In [13]:
import pandas as pd
from statsmodels.stats.outliers_influence import variance_inflation_factor

In [5]:
lst1 = [1200, 1400, 1800, 500, 950]

In [8]:
df = pd.DataFrame(lst1, columns =['monthly_salary'])

In [9]:
df

   monthly_salary
0            1200
1            1400
2            1800
3             500
4             950

In [10]:
df['year_salary'] = df['monthly_salary']*12

In [11]:
df

   monthly_salary  year_salary
0            1200        14400
1            1400        16800
2            1800        21600
3             500         6000
4             950        11400

In [17]:
X = df[['monthly_salary', 'year_salary']]

In [18]:
vif_data = pd.DataFrame() 
vif_data["feature"] = X.columns

In [19]:
vif_data["VIF"] = [variance_inflation_factor(X.values, i) for i in range(len(X.columns))]

In [28]:
vif_data

          feature       VIF
0  monthly_salary       inf
1     year_salary       inf
2          height  7.709168

In [21]:
df['height'] = [174, 189, 185, 198, 149]

In [22]:
df

   monthly_salary  year_salary  height
0            1200        14400     174
1            1400        16800     189
2            1800        21600     185
3             500         6000     198
4             950        11400     149

In [27]:
X = df[['monthly_salary', 'year_salary', 'height']] 
vif_data = pd.DataFrame() 
vif_data["feature"] = X.columns 
vif_data["VIF"] = [variance_inflation_factor(X.values, i) for i in range(len(X.columns))] 
vif_data

          feature       VIF
0  monthly_salary       inf
1     year_salary       inf
2          height  7.709168